Ran Plan for 2 projects:

1. dir: `terraform/EC2-Instance/module/compute` workspace: `default`
1. dir: `terraform/EC2-Instance/module/security` workspace: `default`

### 1. dir: `terraform/EC2-Instance/module/compute` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/home/klept/.atlantis/repos/klept-lab/demo-with-klept/20/default/terraform/EC2-Instance/module/compute/default.tfplan\"" in "/home/klept/.atlantis/repos/klept-lab/demo-with-klept/20/default/terraform/EC2-Instance/module/compute": exit status 1
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 2:
│    2: variable "ami" {
│ 
│ The root module input variable "ami" is not set, and has no default value.
│ Use a -var or -var-file command line argument to provide a value for this
│ variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 6:
│    6: variable "instance_type" {
│ 
│ The root module input variable "instance_type" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 9:
│    9: variable "tag_name" {
│ 
│ The root module input variable "tag_name" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 12:
│   12: variable "sg" {
│ 
│ The root module input variable "sg" is not set, and has no default value.
│ Use a -var or -var-file command line argument to provide a value for this
│ variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 21:
│   21: variable "num_instances" {
│ 
│ The root module input variable "num_instances" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵

```
</details>

---
### 2. dir: `terraform/EC2-Instance/module/security` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_security_group.demo-app-sg will be created
+ resource "aws_security_group" "demo-app-sg" {
      + arn                    = (known after apply)
      + description            = "Allow SSH and Node-Exporter Traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "119.92.254.113/32",
                ]
              + description      = "Allow ssh from HOME"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "152.32.100.47/32",
                ]
              + description      = "Allow incoming traffic on port 9100 from HOME"
              + from_port        = 9100
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9100
            },
          + {
              + cidr_blocks      = [
                  + "152.32.100.47/32",
                ]
              + description      = "Allow ssh from HOME"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "74.48.95.53/32",
                ]
              + description      = "Allow incoming traffic on port 9100 from VPS"
              + from_port        = 9100
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9101
            },
        ]
      + name                   = "Security Group for TestAppServerInstance"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "demo-app"
        }
      + tags_all               = {
          + "Name" = "demo-app"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ demo_app_sg = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/EC2-Instance/module/security`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.demo-with-klept.online/lock?id=klept-lab%252Fdemo-with-klept%252Fterraform%252FEC2-Instance%252Fmodule%252Fsecurity%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/EC2-Instance/module/security`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
